<script lang="ts" setup>
import View from '@/components/View/index.vue'
import Tinymce from '@/components/Tinymce/index.vue'
import { onActivated, ref } from 'vue'

const content = ref(`
<h2>春江花月夜</h2>
<h3>作者：张若虚</h3>

<div>春江潮水连海平，海上明月共潮生。</div>
<div>滟滟随波千万里，何处春江无月明！</div>
<div>江流宛转绕芳甸，月照花林皆似霰；</div>
<div>空里流霜不觉飞，汀上白沙看不见。</div>
<div>江天一色无纤尘，皎皎空中孤月轮。</div>
<div>江畔何人初见月？江月何年初照人？</div>
<div>人生代代无穷已，江月年年望相似。</div>
<div>不知江月待何人，但见长江送流水。</div>
<div>白云一片去悠悠，青枫浦上不胜愁。</div>
<div>谁家今夜扁舟子？何处相思明月楼？</div>
<div>可怜楼上月徘徊，应照离人妆镜台。</div>
<div>玉户帘中卷不去，捣衣砧上拂还来。</div>
<div>此时相望不相闻，愿逐月华流照君。</div>
<div>鸿雁长飞光不度，鱼龙潜跃水成文。</div>
<div>昨夜闲潭梦落花，可怜春半不还家。</div>
<div>江水流春去欲尽，江潭落月复西斜。</div>
<div>斜月沉沉藏海雾，碣石潇湘无限路。</div>
<div>不知乘月几人归，落月摇情满江树。</div>

<h2>概览</h2>
<p>《春江花月夜》是唐代诗人张若虚创作的七言长篇歌行。此诗沿用陈隋乐府旧题，运用富有生活气息的清丽之笔，以江为场景，以月为主体，描绘了一幅幽美邈远、惝恍迷离的春江月夜图，抒写了游子思妇真挚动人的离情别绪以及富有哲理意味的人生感慨，突破了梁陈宫体诗的狭小天地，表现了一种迥绝的宇宙意识，创造了一个深沉、寥廓、宁静的艺术境界。全诗共三十六句，每四句一换韵，通篇融诗情、画意、哲理为一体，意境空明，想象奇特，语言自然隽永，韵律宛转悠扬，为历代文人墨客吟咏唱颂，被闻一多誉为“诗中的诗，顶峰上的顶峰”（《宫体诗的自赎》）。</p>

<h2>作品鉴赏</h2>
<p>此诗题目，以春、江、花、月、夜这五种事物集中体现了人生最动人的良辰美景，构成了诱人探寻的奇妙的艺术境界。整首诗由景、理、情依次展开，第一部分写了春江的美景，第二部分写了面对江月由此产生的感慨，第三部分写了人间思妇游子的离愁别绪。</p>
<p>诗人入手擒题，勾勒出一幅春江月夜的壮丽画面：江潮连海，月共潮生。这里的“海”是虚指。江潮浩瀚无垠，仿佛和大海连在一起，气势宏伟。这时一轮明月随潮涌生，景象壮观。一个“生”字，就赋予了明月与潮水以活泼的生命。月光闪耀千万里之遥，没有一处春江不在明月朗照之中。江水曲曲弯弯地绕过花草遍生的春之原野，月色泻在花树上，像撒上了一层洁白的雪。同时，又巧妙地缴足了“春江花月夜”的题面。诗人对月光的观察极其精微，月光荡涤了世间万物的五光十色，将大千世界浸染成梦幻一样的银辉色。因而“空里流霜不觉飞，汀上白沙看不见”，浑然只有皎洁明亮的月光存在。细腻的笔触，创造了一个神话般美妙的境界，使春江花月夜显得格外幽美恬静。这八句，由大到小，由远及近，笔墨逐渐凝聚在一轮孤月上了。</p>
<p>“江天”两句写月色的皎洁、玉宇的澄明。这是为了承上启下，由江天月色引发对人生的思索。这时，随时间推移，月亮已升到当空。清明澄澈的天地宇宙，仿佛使人进入了一个纯净世界，这就自然地引起了诗人的遐思冥想：“江畔何人初见月？江月何年初照人？”诗人神思飞跃，但又紧紧联系着人生，探索着人生的哲理与宇宙的奥秘。在此处却别开生面，思想没有陷入前人窠臼，而是翻出了新意：“人生代代无穷已，江月年年望相似。”个人的生命是短暂即逝的，而人类的存在则是绵延久长的，因之“代代无穷已”的人生就和“年年望相似”的明月得以共存。诗人虽有对人生短暂的感伤，但并不是颓废与绝望，而是缘于对人生的追求与热爱。“不知江月待何人，但见长江送流水”，这是紧承上一句的“望相似”而来的。人生代代相继，江月年年如此。一轮孤月徘徊中天，像是等待着什么人似的，却又永远不能如愿。月光下，只有大江急流，奔腾远去。随着江水的流动，诗篇遂生波澜，将诗情推向更深远的境界。江月有恨，流水无情，诗人自然地把笔触由上半篇的大自然景色转到了人生图象，引出下半篇男女相思的离愁别恨。</p>
<p>“白云”四句总写在月夜中思妇与游子的两地思念之情。“白云”“青枫浦”托物寓情。白云飘忽，象征“扁舟子”的行踪不定。“青枫浦”为地名，但“枫”“浦”在诗中又常用为感别的景物、处所。“谁家”“何处”二句互文见义，因不止一家、一处有离愁别恨，诗人才提出这样的设问，一种相思，牵出两地离愁，一往一复，诗情荡漾，曲折有致。</p>
<p>接下“可怜”八句承“何处”句，写思妇对游子的怀念。然而诗人不直说思妇的悲和泪，而是用“月”来烘托她的怀念之情，悲泪自出。诗篇把“月”拟人化。“徘徊”二字极其传神：一是浮云游动，故光影明灭不定；二是月光怀着对思妇的怜悯之情，在楼上徘徊不忍去。它要和思妇作伴，为她解愁，因而把柔和的清辉洒在妆镜台上、玉户帘上、捣衣砧上。不料思妇触景生情，反而思念尤甚。她想赶走这恼人的月色，可是月色“卷不去”，“拂还来”，真诚地依恋着她。这里“卷”和“拂”两个痴情的动作，生动地表现出思妇内心的愁怅和迷惘。共望月光而无法相知，只好依托明月遥寄相思之情。“鸿雁长飞光不度”，也暗含鱼雁不能传信之意。</p>
<p>最后八句写游子，诗人用落花、流水、残月来烘托他的思归之情。“扁舟子”连做梦也念念归家——花落幽潭，春光将老，人还远隔天涯，江水流春，流去的不仅是自然的春天，也是游子的青春、幸福和憧憬。江潭落月，更衬托出他凄苦的落寞之情。沉沉的海雾隐遮了落月，碣石、潇湘，天各一方，道路遥远。“沉沉”二字加重渲染了他的孤寂；“无限路”也就无限地加深了他的乡思。他思忖：在这美好的春江花月之夜，不知有几人能乘月归回自己的家乡。他那无着无落的离情，伴着残月之光，洒满在江边的树林之上。“落月摇情满江树”，这结句的“摇情”——不绝如缕的思念之情，将月光之情，游子之情，诗人之情交织成一片，情韵袅袅，摇曳生姿，有一种令人回味不尽的绵邈韵味。</p>
<p>《春江花月夜》在思想与艺术上都超越了以前那些单纯模山范水的景物诗，诗人将这些屡见不鲜的传统题材，注入了新的含义，融诗情、画意、哲理为一体，凭借对春江花月夜的描绘，尽情赞叹大自然的奇丽景色，讴歌人间纯洁的爱情，把对游子思妇的同情心扩大开来，与对人生哲理的追求、对宇宙奥秘的探索结合起来，从而汇成一种情、景、理水乳交溶的幽美而邈远的意境。诗人将深邃美丽的艺术世界特意隐藏在惝恍迷离的艺术氛围之中，整首诗篇仿佛笼罩在一片空灵而迷茫的月色里，吸引着读者去探寻其中美的真谛。</p>
<p>全诗紧扣春、江、花、月、夜的背景来写，而又以月为主体。“月”是诗中情景兼融之物，它跳动着诗人的脉搏，在全诗中犹如一条生命纽带，通贯上下，诗情随着月轮的升落而起伏曲折。月在一夜之间经历了升起——高悬——西斜——落下的过程。在月的照耀下，江水、沙滩、天空、原野、枫树、花林、飞霜、白沙、扁舟、高楼、镜台、砧石、长飞的鸿雁、潜跃的鱼龙，以及不眠的思妇、漂泊的游子，组成了完整的诗歌形象，展现出一幅充满人生哲理与生活情趣的画卷。这幅画卷在色调上是以淡寓浓，虽用水墨勾勒点染，但“墨分五彩”，从黑白相辅、虚实相生中显出绚烂多彩的艺术效果，宛如一幅淡雅的中国水墨画，体现出春江花月夜清幽的意境美。</p>
<p>此诗的章法结构，以整齐为基调，以错杂显变化。诗的韵律节奏饶有特色。诗人灌注在诗中的感情旋律极其悲慨激荡，但那旋律既不是哀丝豪竹，也不是急管繁弦，而是像小提琴奏出的小夜曲或梦幻曲：含蕴，隽永。诗的内在感情是那样热烈、深沉，看来却是自然的、平和的，犹如脉搏跳动那样有规律，有节奏，而诗的韵律也相应地扬抑回旋。全诗共三十六句，四句一换韵，共换九韵。又平声庚韵起首，中间为仄声霰韵、平声真韵、仄声纸韵、平声尤韵、灰韵、文韵、麻韵，最后以仄声遇韵结束。诗人把阳辙韵与阴辙韵交互杂沓，高低音相间，依次为洪亮级（庚、霰、真）——细微级（纸）——柔和级（尤、灰）——洪亮级（文、麻）——细微级（遇）。全诗随着韵脚的转换变化，平仄的交错运用，一唱三叹，前呼后应，既回环反复，又层出不穷，音乐节奏感强烈而优美。这种语音与韵味的变化，又是切合着诗情的起伏，可谓声情与文情丝丝入扣，宛转谐美，完美地体现了情、景、理、声交融的美妙诗境。</p>
<p>当然，《春江花月夜》这一乐府旧题还是属于艳情宫体诗的范畴，张若虚这首诗尽管没有堕落的成分，但还是有着惆怅低沉的感伤。它纵然与一般宫体诗风貌完全不同，但在内容上依然是游子思妇的传统主题，在情调和旋律上也还未完全洗净和摆脱宫体诗的痕迹。</p>
<p>来自<a href="https://baike.baidu.com/item/%E6%98%A5%E6%B1%9F%E8%8A%B1%E6%9C%88%E5%A4%9C/1701">『百度百科』</a></p>
`)

const tinymceKey = ref(1)
const minHeight = window.innerHeight - 360

onActivated(() => {
  tinymceKey.value++
})
</script>
<template>
  <View class="app-text-editor" title="富文本编辑器">
    <a-row :gutter="24">
      <a-col :span="12">
        <Tinymce :key="tinymceKey" v-model:content="content" :value="content" width="100%" :height="minHeight.toString()" />
      </a-col>
      <a-col :span="12">
        <div class="content overflow-y-auto border border-gray-200 py-6 px-3 bg-green-50 text-green-900" :style="{ height: `${minHeight + 108}px` }" v-html="content"></div>
      </a-col>
    </a-row>
  </View>
</template>
<style lang="scss">
.app-text-editor {
  .content {
    padding-top: 5px;
    line-height: 1.8;
    font-size: 18px;
    h1 {
      margin: 1em 0;
    }
    h2 {
      margin: 0.5em 0;
    }
    p {
      font-size: 16px;
      margin-bottom: 1em;
      text-indent: 2em;
    }
  }
}
</style>
